export const catalog = [
  {
    name: "Раздел 1",
    id: 555,
    subCategories: [
      {
        title: "Подраздел 1",
        id: 1,
        tasks: [
          {
            id: 1,
            title:
              "Детство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочиненияДетство Гоголя прошло там же, на Полтавщине – в родовом имении Васильевка Миргородского уезда. Места, где вырос писатель, впоследствии будут увековечены им в знаменитых сборниках «Вечера на хуторе близ Диканьки» и «Миргород». Отец Николая Василий Афанасьевич был страстным любителем театра: выйдя в отставку в должности коллежского асессора, он устроил домашний театр и начал сочинять для него пьесы. По воспоминаниям современников, Василий Гоголь-Яновский был блестящим рассказчиком и обладал незаурядным литературным талантом. Он, по всей видимости, и передал свои склонности и увлечения сыну, научил его владеть словом. Например, в качестве игры отец просил маленького Николая придумывать рифмы к разным словам. Уже в пятилетнем возрасте мальчик записывал свои первые сочинения",

            isCompleted: false,
          },
          {
            id: 2,
            title:
              "«Лео́н» (фр. Léon, прокатное название в Северной Америке — «Профессионал» (англ. The Professional)) — фильм французского режиссёра Люка Бессона о профессиональном наёмном убийце по имени Леон, познакомившемся со своей соседкой Матильдой в результате трагической гибели её семьи. Фильм вышел на экраны в 1994 году. Снят по собственному сценарию Бессона. Главные роли исполнили Жан Рено, Гэри Олдмен, Натали Портман и Дэнни Айелло.",

            isCompleted: false,
          },
          {
            id: 3,
            title:
              "Самолёт (устар. аэроплан) — класс воздушных судов тяжелее воздуха, предназначенных для полётов в атмосфере с помощью силового агрегата, создающего тягу и неподвижного относительно других частей аппарата крыла, создающего подъёмную силу[4][5]. Неподвижное крыло отличает самолёт от махолёта (орнитоптера) и вертолёта, а наличие двигателя — от планёра и мускулолёта. От дирижабля и аэростата самолёт отличается тем, что использует аэродинамический, а не аэростатический способ создания подъёмной силы.",

            isCompleted: false,
          },
          { id: 4, title: "Четвертая задача", isCompleted: false },
        ],
      },
      {
        title: "Подраздел 2",
        id: 2,
        tasks: [
          { id: 3, title: "Купить хлеб", isCompleted: false },
          { id: 4, title: "Купить молока", isCompleted: true },
        ],
      },
    ],
  },
  {
    name: "Раздел 2",
    id: 4324,
    subCategories: [
      {
        title: "Подраздел 3",
        id: 3,
        tasks: [
          { id: 1, title: "Задача 3", isCompleted: false },
          { id: 2, title: "Задача 4", isCompleted: true },
        ],
      },
      {
        title: "Подраздел 4",
        id: 4,
        tasks: [
          { id: 3, title: "Дописать код", isCompleted: false },
          { id: 4, title: "Исправить ошибки", isCompleted: true },
        ],
      },
    ],
  },
];
